In [3]:
import pandas as pd
import numpy as np

df=pd.read_excel('state_M2024_dl.xlsx')

In [7]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37609 entries, 0 to 37608
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37609 non-null  int64
 1   AREA_TITLE    37609 non-null  object
 2   AREA_TYPE     37609 non-null  int64
 3   PRIM_STATE    37609 non-null  object
 4   NAICS         37609 non-null  int64
 5   NAICS_TITLE   37609 non-null  object
 6   I_GROUP       37609 non-null  object
 7   OWN_CODE      37609 non-null  int64
 8   OCC_CODE      37609 non-null  object
 9   OCC_TITLE     37609 non-null  object
 10  O_GROUP       37609 non-null  object
 11  TOT_EMP       37609 non-null  object
 12  EMP_PRSE      37609 non-null  object
 13  JOBS_1000     37609 non-null  object
 14  LOC_QUOTIENT  37609 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37609 non-null  object
 18  A_MEAN        37609 non-null  object
 19  MEAN_PRSE     37609 non-null  object
 20  H_PCT10       37609 non-null  object
 21  H_PCT25       37609 non-null  object
 22  H_MEDIAN      37609 non-null  object
 23  H_PCT75       37609 non-null  object
 24  H_PCT90       37609 non-null  object
 25  A_PCT10       37609 non-null  object
 26  A_PCT25       37609 non-null  object
 27  A_MEDIAN      37609 non-null  object
 28  A_PCT75       37609 non-null  object
 29  A_PCT90       37609 non-null  object
 30  ANNUAL        2666 non-null   object
 31  HOURLY        162 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

In [8]:
df.head()

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,...,21.07,30.82,47.51,23520,30660,43830,64110,98810,NaN,NaN
1,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,...,48.39,68.5,98.03,51100,72870,100640,142480,203900,NaN,NaN
2,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,...,79.04,106.69,#,104950,130950,164400,221910,#,NaN,NaN
3,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1021,General and Operations Managers,...,51.12,78.26,#,50410,74720,106330,162780,#,NaN,NaN
4,1,Alabama,2,AL,0,Cross-industry,cross-industry,1235,11-1031,Legislators,...,*,*,*,18270,20950,26990,41760,63900,True,NaN

In [9]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 37609 entries, 0 to 37608
Data columns (total 32 columns):
 #   Column        Non-Null Count  Dtype
---  ------        --------------  -----
 0   AREA          37609 non-null  int64
 1   AREA_TITLE    37609 non-null  object
 2   AREA_TYPE     37609 non-null  int64
 3   PRIM_STATE    37609 non-null  object
 4   NAICS         37609 non-null  int64
 5   NAICS_TITLE   37609 non-null  object
 6   I_GROUP       37609 non-null  object
 7   OWN_CODE      37609 non-null  int64
 8   OCC_CODE      37609 non-null  object
 9   OCC_TITLE     37609 non-null  object
 10  O_GROUP       37609 non-null  object
 11  TOT_EMP       37609 non-null  object
 12  EMP_PRSE      37609 non-null  object
 13  JOBS_1000     37609 non-null  object
 14  LOC_QUOTIENT  37609 non-null  object
 15  PCT_TOTAL     0 non-null      float64
 16  PCT_RPT       0 non-null      float64
 17  H_MEAN        37609 non-null  object
 18  A_MEAN        37609 non-null  object
 19  MEAN_PRSE     37609 non-null  object
 20  H_PCT10       37609 non-null  object
 21  H_PCT25       37609 non-null  object
 22  H_MEDIAN      37609 non-null  object
 23  H_PCT75       37609 non-null  object
 24  H_PCT90       37609 non-null  object
 25  A_PCT10       37609 non-null  object
 26  A_PCT25       37609 non-null  object
 27  A_MEDIAN      37609 non-null  object
 28  A_PCT75       37609 non-null  object
 29  A_PCT90       37609 non-null  object
 30  ANNUAL        2666 non-null   object
 31  HOURLY        162 non-null    object
dtypes: float64(2), int64(4), object(26)
memory usage: 9.2+ MB

In [10]:
df.describe()

               AREA     AREA_TYPE    NAICS  OWN_CODE  PCT_TOTAL  PCT_RPT
count  37609.000000  37609.000000  37609.0   37609.0        0.0      0.0
mean      30.176633      2.026829      0.0    1235.0        NaN      NaN
std       16.823968      0.161585      0.0       0.0        NaN      NaN
min        1.000000      2.000000      0.0    1235.0        NaN      NaN
25%       17.000000      2.000000      0.0    1235.0        NaN      NaN
50%       30.000000      2.000000      0.0    1235.0        NaN      NaN
75%       44.000000      2.000000      0.0    1235.0        NaN      NaN
max       78.000000      3.000000      0.0    1235.0        NaN      NaN

In [ ]:
#Dropping columns that are just missing values in them since they are of no use to us
missing_calue_cols=[
    'PCT_TOTAL','PCT_RPT','ANNUAL','HOURLY'
]
df=df.drop(columns=missing_calue_cols)

In [16]:
df_filtered = df[['OCC_TITLE', 'TOT_EMP', 'A_MEAN', 'PRIM_STATE', 'O_GROUP']]
df_filtered.head()

                         OCC_TITLE  TOT_EMP  A_MEAN PRIM_STATE   O_GROUP
0                  All Occupations  2091480   55350         AL     total
1           Management Occupations   110240  118670         AL     major
2                 Chief Executives      830  207190         AL  detailed
3  General and Operations Managers    32370  134790         AL  detailed
4                      Legislators     1120   36570         AL  detailed